In [1]:
# prepare data

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

df = sns.load_dataset('titanic', cache = True)

In [2]:
# summary of the dataset

df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
df.shape

(891, 15)

In [6]:
# check for total index and columns

df.info()

# looking at the RangeIndex each column has 891 data elements
# but we can confirm that 177 of data elements are missing in the 'age' column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [7]:
# check for the NaN

df['age'].value_counts(dropna = False)

age
NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
0.92       1
23.50      1
74.00      1
Name: count, Length: 89, dtype: int64

In [8]:
df['deck'].value_counts(dropna = False)

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [9]:
# finding missing data. return True if missing

df.isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [10]:
# finding missing data. return False if missing

df.notnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
887,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
888,True,True,True,False,True,True,True,True,True,True,True,False,True,True,True
889,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
890,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True

In [11]:
# sum of the missing data in each column

df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [12]:
# sum of the missing data of the entire dataset

df.isnull().sum().sum()

869

In [13]:
# sum of missing data of the dataset

# df.count() count nonnull values for each column
# substract this from the toal num of data, then it will give the count of missing data
(len(df)-df.count()).sum()

869

### removing missing data

subset='age', remove NaN values. if age is important, its good to remove the rows (data) with mssing age.

how='any', only delete rows if all data is NaN

In [14]:
# delete missing data

# syntax: DataFrame(axis=1, how='any', thresh=None, subset=None, inplace=False)

# since total=891 and missing 'deck'=688. it is irrelevant for data processing and analysis

new_df = df.dropna(axis = 1, thresh = 500) #delete columns with 500/more NaN values
                                           #axis deletes row

new_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [18]:
age_df = df.dropna(axis = 0, how = 'any', subset = ['age'])
len(age_df)

714

In [19]:
# if any of the row contains any NaN values, it deletes (operate by rows)

no = df.dropna()
no.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [20]:
len(no)

182

In [21]:
no = df.dropna(axis = 0, how = 'any')
len(no)

182

### replacing missing data

DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)

In [22]:
# replace with mean value

import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic', cache = True)   # load the titanic dataset
df['age'].head(10)  # check data in 'age' column, NaN values are found

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [23]:
avg_age = df['age'].mean(axis = 0)  # calc mean value and store it, will be represent the age column
avg_age

29.69911764705882

In [24]:
median_age = df['age'].median(axis = 0) # can also use median value to replace
median_age

28.0

In [25]:
# use fillna to replace age with mean value
df['age'].fillna(avg_age, inplace = True)

In [26]:
df['age'].head(10) # displayed with mean value

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [27]:
df.isnull().sum()  # no more missing values in the age column

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [28]:
# replace embark_town value

import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic', cache = True) # load the titanic dataset

In [29]:
town_count = df['embark_town'].value_counts(dropna = True)
town_count

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [30]:
type(town_count)

pandas.core.series.Series

In [33]:
most = town_count.idxmax() # returns the index where the maximum value first occurs in the requested axis
most

'Southampton'

In [34]:
df['embark_town'].fillna(most, inplace = True)  # replaced with most
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      0
alive            0
alone            0
dtype: int64

### replacing with neighboring values

In [35]:
# ffill : forward fill
# bfill : backward fill

import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic', cache = True)
null_indexes = df[df['embark_town'].isna()].index  # isna(): identify the location of missing data
null_indexes

Index([61, 829], dtype='int64')

In [39]:
df['embark_town'].fillna(method = 'ffill', inplace = True)
df[60 : 62]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
60,0,3,male,22.0,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
61,1,1,female,38.0,0,0,80.0000,NaN,First,woman,False,B,Cherbourg,yes,True

In [41]:
df = sns.load_dataset('titanic', cache = True)
df['embark_town'].fillna(method = 'bfill', inplace = True)
df[60 : 62]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
60,0,3,male,22.0,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
61,1,1,female,38.0,0,0,80.0000,NaN,First,woman,False,B,Southampton,yes,True